Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4553.PIC
        <edc:SFRDef edc:access="n--nnnnn" edc:cname="UEIE" edc:desc="" edc:impl="0x9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--00000" edc:name="UEIE" edc:nzwidth="0x8" edc:por="0--00000" edc:_addr="0xF6B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIDEE" edc:desc="" edc:mask="0x1" edc:name="PIDEE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRC5EE" edc:desc="" edc:mask="0x1" edc:name="CRC5EE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRC16EE" edc:desc="" edc:mask="0x1" edc:name="CRC16EE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DFN8EE" edc:desc="" edc:mask="0x1" edc:name="DFN8EE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOEE" edc:desc="" edc:mask="0x1" edc:name="BTOEE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="BTSEE" edc:desc="" edc:mask="0x1" edc:name="BTSEE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrrrrr-" edc:cname="USTAT" edc:desc="" edc:impl="0x7e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-xxxxxx-" edc:name="USTAT" edc:nzwidth="0x8" edc:por="-xxxxxx-" edc:_addr="0xF6C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PPBI" edc:desc="" edc:mask="0x1" edc:name="PPBI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DIR" edc:desc="" edc:mask="0x1" edc:name="DIR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENDP" edc:desc="" edc:mask="0xf" edc:name="ENDP" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ENDP0" edc:desc="" edc:mask="0x1" edc:name="ENDP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENDP1" edc:desc="" edc:mask="0x1" edc:name="ENDP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENDP2" edc:desc="" edc:mask="0x1" edc:name="ENDP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENDP3" edc:desc="" edc:mask="0x1" edc:name="ENDP3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nrcnnn-" edc:cname="UCON" edc:desc="" edc:impl="0x7e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0x0000-" edc:name="UCON" edc:nzwidth="0x8" edc:por="-0x0000-" edc:_addr="0xF6D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SUSPND" edc:desc="" edc:mask="0x1" edc:name="SUSPND" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESUME" edc:desc="" edc:mask="0x1" edc:name="RESUME" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="USBEN" edc:desc="" edc:mask="0x1" edc:name="USBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PKTDIS" edc:desc="" edc:mask="0x1" edc:name="PKTDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE0" edc:desc="" edc:mask="0x1" edc:name="SE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPBRST" edc:desc="" edc:mask="0x1" edc:name="PPBRST" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="UADDR" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="UADDR" edc:nzwidth="0x8" edc:por="-0000000" edc:_addr="0xF6E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADDR" edc:desc="" edc:mask="0x7f" edc:name="ADDR" edc:nzwidth="0x7"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADDR0" edc:desc="" edc:mask="0x1" edc:name="ADDR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDR1" edc:desc="" edc:mask="0x1" edc:name="ADDR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDR2" edc:desc="" edc:mask="0x1" edc:name="ADDR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDR3" edc:desc="" edc:mask="0x1" edc:name="ADDR3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDR4" edc:desc="" edc:mask="0x1" edc:name="ADDR4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDR5" edc:desc="" edc:mask="0x1" edc:name="ADDR5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDR6" edc:desc="" edc:mask="0x1" edc:name="ADDR6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="UCFG" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="UCFG" edc:nzwidth="0x8" edc:por="00-00000" edc:_addr="0xF6F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPB" edc:desc="" edc:mask="0x3" edc:name="PPB" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FSEN" edc:desc="" edc:mask="0x1" edc:name="FSEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UTRDIS" edc:desc="" edc:mask="0x1" edc:name="UTRDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPUEN" edc:desc="" edc:mask="0x1" edc:name="UPUEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="UOEMON" edc:desc="" edc:mask="0x1" edc:name="UOEMON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UTEYE" edc:desc="" edc:mask="0x1" edc:name="UTEYE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PPB0" edc:desc="" edc:mask="0x1" edc:name="PPB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPB1" edc:desc="" edc:mask="0x1" edc:name="PPB1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="UPP0" edc:desc="" edc:mask="0x1" edc:name="UPP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UPP1" edc:desc="" edc:mask="0x1" edc:name="UPP1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="UEP0" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="UEP0" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xF70">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPINEN" edc:desc="" edc:mask="0x1" edc:name="EPINEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="EP0STALL" edc:desc="" edc:mask="0x1" edc:name="EP0STALL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP0INEN" edc:desc="" edc:mask="0x1" edc:name="EP0INEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP0OUTEN" edc:desc="" edc:mask="0x1" edc:name="EP0OUTEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP0CONDIS" edc:desc="" edc:mask="0x1" edc:name="EP0CONDIS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP0HSHK" edc:desc="" edc:mask="0x1" edc:name="EP0HSHK" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:SFRFieldDef edc:cname="EPSTALL0" edc:desc="" edc:mask="0x1" edc:name="EPSTALL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPINEN0" edc:desc="" edc:mask="0x1" edc:name="EPINEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN0" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS0" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK0" edc:desc="" edc:mask="0x1" edc:name="EPHSHK0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="UEP1" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="UEP1" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xF71">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPINEN" edc:desc="" edc:mask="0x1" edc:name="EPINEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="EP1STALL" edc:desc="" edc:mask="0x1" edc:name="EP1STALL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP1INEN" edc:desc="" edc:mask="0x1" edc:name="EP1INEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP1OUTEN" edc:desc="" edc:mask="0x1" edc:name="EP1OUTEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP1CONDIS" edc:desc="" edc:mask="0x1" edc:name="EP1CONDIS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP1HSHK" edc:desc="" edc:mask="0x1" edc:name="EP1HSHK" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:SFRFieldDef edc:cname="EPSTALL1" edc:desc="" edc:mask="0x1" edc:name="EPSTALL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPINEN1" edc:desc="" edc:mask="0x1" edc:name="EPINEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN1" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS1" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK1" edc:desc="" edc:mask="0x1" edc:name="EPHSHK1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="UEP2" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="UEP2" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xF72">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPINEN" edc:desc="" edc:mask="0x1" edc:name="EPINEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="EP2STALL" edc:desc="" edc:mask="0x1" edc:name="EP2STALL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP2INEN" edc:desc="" edc:mask="0x1" edc:name="EP2INEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP2OUTEN" edc:desc="" edc:mask="0x1" edc:name="EP2OUTEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP2CONDIS" edc:desc="" edc:mask="0x1" edc:name="EP2CONDIS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP2HSHK" edc:desc="" edc:mask="0x1" edc:name="EP2HSHK" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:SFRFieldDef edc:cname="EPSTALL2" edc:desc="" edc:mask="0x1" edc:name="EPSTALL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPINEN2" edc:desc="" edc:mask="0x1" edc:name="EPINEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN2" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS2" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK2" edc:desc="" edc:mask="0x1" edc:name="EPHSHK2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="UEP3" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="UEP3" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xF73">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPINEN" edc:desc="" edc:mask="0x1" edc:name="EPINEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="EP3STALL" edc:desc="" edc:mask="0x1" edc:name="EP3STALL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP3INEN" edc:desc="" edc:mask="0x1" edc:name="EP3INEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP3OUTEN" edc:desc="" edc:mask="0x1" edc:name="EP3OUTEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP3CONDIS" edc:desc="" edc:mask="0x1" edc:name="EP3CONDIS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP3HSHK" edc:desc="" edc:mask="0x1" edc:name="EP3HSHK" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:SFRFieldDef edc:cname="EPSTALL3" edc:desc="" edc:mask="0x1" edc:name="EPSTALL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPINEN3" edc:desc="" edc:mask="0x1" edc:name="EPINEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN3" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS3" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK3" edc:desc="" edc:mask="0x1" edc:name="EPHSHK3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="UEP4" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="UEP4" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xF74">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPINEN" edc:desc="" edc:mask="0x1" edc:name="EPINEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="EP4STALL" edc:desc="" edc:mask="0x1" edc:name="EP4STALL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP4INEN" edc:desc="" edc:mask="0x1" edc:name="EP4INEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP4OUTEN" edc:desc="" edc:mask="0x1" edc:name="EP4OUTEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP4CONDIS" edc:desc="" edc:mask="0x1" edc:name="EP4CONDIS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP4HSHK" edc:desc="" edc:mask="0x1" edc:name="EP4HSHK" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:SFRFieldDef edc:cname="EPSTALL4" edc:desc="" edc:mask="0x1" edc:name="EPSTALL4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPINEN4" edc:desc="" edc:mask="0x1" edc:name="EPINEN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN4" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS4" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK4" edc:desc="" edc:mask="0x1" edc:name="EPHSHK4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="UEP5" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="UEP5" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xF75">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPINEN" edc:desc="" edc:mask="0x1" edc:name="EPINEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="EP5STALL" edc:desc="" edc:mask="0x1" edc:name="EP5STALL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP5INEN" edc:desc="" edc:mask="0x1" edc:name="EP5INEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP5OUTEN" edc:desc="" edc:mask="0x1" edc:name="EP5OUTEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP5CONDIS" edc:desc="" edc:mask="0x1" edc:name="EP5CONDIS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP5HSHK" edc:desc="" edc:mask="0x1" edc:name="EP5HSHK" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:SFRFieldDef edc:cname="EPSTALL5" edc:desc="" edc:mask="0x1" edc:name="EPSTALL5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPINEN5" edc:desc="" edc:mask="0x1" edc:name="EPINEN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN5" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS5" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK5" edc:desc="" edc:mask="0x1" edc:name="EPHSHK5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="UEP6" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="UEP6" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xF76">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPINEN" edc:desc="" edc:mask="0x1" edc:name="EPINEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="EP6STALL" edc:desc="" edc:mask="0x1" edc:name="EP6STALL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP6INEN" edc:desc="" edc:mask="0x1" edc:name="EP6INEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP6OUTEN" edc:desc="" edc:mask="0x1" edc:name="EP6OUTEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP6CONDIS" edc:desc="" edc:mask="0x1" edc:name="EP6CONDIS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP6HSHK" edc:desc="" edc:mask="0x1" edc:name="EP6HSHK" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:SFRFieldDef edc:cname="EPSTALL6" edc:desc="" edc:mask="0x1" edc:name="EPSTALL6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPINEN6" edc:desc="" edc:mask="0x1" edc:name="EPINEN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN6" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS6" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK6" edc:desc="" edc:mask="0x1" edc:name="EPHSHK6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
