Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4553.PIC
        <edc:JoinedSFRDef edc:cname="TMR3" edc:desc="" edc:name="TMR3" edc:nzwidth="0x10" edc:_addr="0xFB2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3" edc:desc="" edc:mask="0xffff" edc:name="TMR3" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR3L" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xFB2">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR3L" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TMR3L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR3H" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xFB3">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR3H" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TMR3H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="rrnnnnnn" edc:cname="CMCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000111" edc:name="CMCON" edc:nzwidth="0x8" edc:por="00000111" edc:_addr="0xFB4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CM" edc:desc="" edc:mask="0x7" edc:name="CM" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="CIS" edc:desc="" edc:mask="0x1" edc:name="CIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1INV" edc:desc="" edc:mask="0x1" edc:name="C1INV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2INV" edc:desc="" edc:mask="0x1" edc:name="C2INV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1OUT" edc:desc="" edc:mask="0x1" edc:name="C1OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CM0" edc:desc="" edc:mask="0x1" edc:name="CM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CM1" edc:desc="" edc:mask="0x1" edc:name="CM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CM2" edc:desc="" edc:mask="0x1" edc:name="CM2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="CMEN0" edc:desc="" edc:mask="0x1" edc:name="CMEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMEN1" edc:desc="" edc:mask="0x1" edc:name="CMEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMEN2" edc:desc="" edc:mask="0x1" edc:name="CMEN2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CVRCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CVRCON" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFB5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CVR" edc:desc="" edc:mask="0xf" edc:name="CVR" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="CVRSS" edc:desc="" edc:mask="0x1" edc:name="CVRSS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVRR" edc:desc="" edc:mask="0x1" edc:name="CVRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVROE" edc:desc="" edc:mask="0x1" edc:name="CVROE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVREN" edc:desc="" edc:mask="0x1" edc:name="CVREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CVR0" edc:desc="" edc:mask="0x1" edc:name="CVR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVR1" edc:desc="" edc:mask="0x1" edc:name="CVR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVR2" edc:desc="" edc:mask="0x1" edc:name="CVR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVR3" edc:desc="" edc:mask="0x1" edc:name="CVR3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVREF" edc:desc="" edc:mask="0x1" edc:name="CVREF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="CVROEN" edc:desc="" edc:mask="0x1" edc:name="CVROEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP1AS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP1AS" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFB6">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CCP1AS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSSBD" edc:desc="" edc:mask="0x3" edc:name="PSSBD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PSSAC" edc:desc="" edc:mask="0x3" edc:name="PSSAC" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="ECCPAS" edc:desc="" edc:mask="0x7" edc:name="ECCPAS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ECCPASE" edc:desc="" edc:mask="0x1" edc:name="ECCPASE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSSBD0" edc:desc="" edc:mask="0x1" edc:name="PSSBD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSSBD1" edc:desc="" edc:mask="0x1" edc:name="PSSBD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSSAC0" edc:desc="" edc:mask="0x1" edc:name="PSSAC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSSAC1" edc:desc="" edc:mask="0x1" edc:name="PSSAC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCPAS0" edc:desc="" edc:mask="0x1" edc:name="ECCPAS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCPAS1" edc:desc="" edc:mask="0x1" edc:name="ECCPAS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCPAS2" edc:desc="" edc:mask="0x1" edc:name="ECCPAS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP1DEL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP1DEL" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFB7">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CCP1DEL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDC" edc:desc="" edc:mask="0x7f" edc:name="PDC" edc:nzwidth="0x7"/>
              <edc:SFRFieldDef edc:cname="PRSEN" edc:desc="" edc:mask="0x1" edc:name="PRSEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PDC0" edc:desc="" edc:mask="0x1" edc:name="PDC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC1" edc:desc="" edc:mask="0x1" edc:name="PDC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC2" edc:desc="" edc:mask="0x1" edc:name="PDC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC3" edc:desc="" edc:mask="0x1" edc:name="PDC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC4" edc:desc="" edc:mask="0x1" edc:name="PDC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC5" edc:desc="" edc:mask="0x1" edc:name="PDC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC6" edc:desc="" edc:mask="0x1" edc:name="PDC6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="crnnn-nn" edc:cname="BAUDCON" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01000-00" edc:name="BAUDCON" edc:nzwidth="0x8" edc:por="01000-00" edc:_addr="0xFB8">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="BAUDCTL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BRG16" edc:desc="" edc:mask="0x1" edc:name="BRG16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXCKP" edc:desc="" edc:mask="0x1" edc:name="TXCKP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXDTP" edc:desc="" edc:mask="0x1" edc:name="RXDTP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:desc="" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SCKP" edc:desc="" edc:mask="0x1" edc:name="SCKP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RCMT" edc:desc="" edc:mask="0x1" edc:name="RCMT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="RXCKP" edc:desc="" edc:mask="0x1" edc:name="RXCKP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0xFB9"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP2CON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP2CON" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0xFBA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2M" edc:desc="" edc:mask="0xf" edc:name="CCP2M" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="DC2B" edc:desc="" edc:mask="0x3" edc:name="DC2B" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2M0" edc:desc="" edc:mask="0x1" edc:name="CCP2M0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2M1" edc:desc="" edc:mask="0x1" edc:name="CCP2M1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2M2" edc:desc="" edc:mask="0x1" edc:name="CCP2M2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2M3" edc:desc="" edc:mask="0x1" edc:name="CCP2M3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC2B0" edc:desc="" edc:mask="0x1" edc:name="DC2B0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC2B1" edc:desc="" edc:mask="0x1" edc:name="DC2B1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR2" edc:desc="" edc:name="CCPR2" edc:nzwidth="0x10" edc:_addr="0xFBB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCPR2" edc:desc="" edc:mask="0xffff" edc:name="CCPR2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2L" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xFBB">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR2L" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CCPR2L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2H" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xFBC">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR2H" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CCPR2H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCP1CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCP1CON" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFBD">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="ECCP1CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1M" edc:desc="" edc:mask="0xf" edc:name="CCP1M" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="DC1B" edc:desc="" edc:mask="0x3" edc:name="DC1B" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="P1M" edc:desc="" edc:mask="0x3" edc:name="P1M" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1M0" edc:desc="" edc:mask="0x1" edc:name="CCP1M0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1M1" edc:desc="" edc:mask="0x1" edc:name="CCP1M1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1M2" edc:desc="" edc:mask="0x1" edc:name="CCP1M2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1M3" edc:desc="" edc:mask="0x1" edc:name="CCP1M3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC1B0" edc:desc="" edc:mask="0x1" edc:name="DC1B0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC1B1" edc:desc="" edc:mask="0x1" edc:name="DC1B1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1M0" edc:desc="" edc:mask="0x1" edc:name="P1M0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1M1" edc:desc="" edc:mask="0x1" edc:name="P1M1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR1" edc:desc="" edc:name="CCPR1" edc:nzwidth="0x10" edc:_addr="0xFBE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCPR1" edc:desc="" edc:mask="0xffff" edc:name="CCPR1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR1L" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xFBE">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR1L" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CCPR1L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR1H" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xFBF">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR1H" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CCPR1H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="ADCON2" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="ADCON2" edc:nzwidth="0x8" edc:por="0-000000" edc:_addr="0xFC0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCS" edc:desc="" edc:mask="0x7" edc:name="ADCS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ACQT" edc:desc="" edc:mask="0x7" edc:name="ACQT" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADFM" edc:desc="" edc:mask="0x1" edc:name="ADFM" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCS0" edc:desc="" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS1" edc:desc="" edc:mask="0x1" edc:name="ADCS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS2" edc:desc="" edc:mask="0x1" edc:name="ADCS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACQT0" edc:desc="" edc:mask="0x1" edc:name="ACQT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACQT1" edc:desc="" edc:mask="0x1" edc:name="ACQT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACQT2" edc:desc="" edc:mask="0x1" edc:name="ACQT2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADCON1" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="ADCON1" edc:nzwidth="0x8" edc:por="--00qqqq" edc:_addr="0xFC1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCFG" edc:desc="" edc:mask="0xf" edc:name="PCFG" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="VCFG" edc:desc="" edc:mask="0x3" edc:name="VCFG" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PCFG0" edc:desc="" edc:mask="0x1" edc:name="PCFG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCFG1" edc:desc="" edc:mask="0x1" edc:name="PCFG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCFG2" edc:desc="" edc:mask="0x1" edc:name="PCFG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCFG3" edc:desc="" edc:mask="0x1" edc:name="PCFG3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VCFG0" edc:desc="" edc:mask="0x1" edc:name="VCFG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VCFG1" edc:desc="" edc:mask="0x1" edc:name="VCFG1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="CHSN3" edc:desc="" edc:mask="0x1" edc:name="CHSN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VCFG01" edc:desc="" edc:mask="0x1" edc:name="VCFG01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VCFG11" edc:desc="" edc:mask="0x1" edc:name="VCFG11" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
